package Map;

public class TechSpec {
    /*
    1. Консольное меню для управления программой.
    1.1. Создать методы:
    * Войти под существующей учетной записью.
    * Зарегистрироваться. Проверка на то, что логин не дублирует уже существующие.
    * Демо-режим.
    ** Вывести список всех пользователей.
    ** Вывести количество пользователей.
    ** Изменить данные пользователя. По логину можно изменять как сам логин, так и пароль.
    При изменении логина будет проверка на то, что новый логин не занят.
    2. Генерация объектов в json.
    3. При запуске программы считывать данные из файла, в конце перезаписывать новые данные в файл.
    4. Создать отдельный класс с полями login и password и с переопределенным toString под генерацию json.
    5. Подсчет пользователей.
    6. Можно попробовать добавить метод логина под существующем пользователем.
     */
}
